
var StreetJsonData2 = {
    "东城区": [113.789591, 23.033939],
    "南城区": [113.749579, 23.024861],
    "万江区": [113.744808, 23.052907],
    "莞城区": [113.755568, 23.045351],
    "石碣镇": [113.819816, 23.10501],
    "石龙镇": [113.880728, 23.111615],
    "茶山镇": [113.875579, 23.08251],
    "石排镇": [113.94655, 23.09486],
    "企石镇": [114.028531, 23.079041],
    "横沥镇": [113.972995, 23.024814],
    "桥头镇": [114.109497, 23.030029],
    "谢岗镇": [114.155141, 22.967218],
    "东坑镇": [113.954651, 22.995098],
    "常平镇": [113.999511, 22.981052],
    "寮步镇": [113.881157, 23.003838],
    "樟木头镇": [114.089784, 22.920827],
    "大朗镇": [113.950584, 22.945658],
    "黄江镇": [114.009988, 22.921615],
    "清溪镇": [114.17089, 22.85031],
    "塘厦镇": [114.075528, 22.813052],
    "凤岗镇": [114.143323, 22.75306],
    "大岭山镇": [113.848731, 22.90585],
    "长安镇": [113.809036, 22.821046],
    "虎门镇": [113.679324, 22.820653],
    "厚街镇": [113.676673, 22.941392],
    "沙田镇": [113.624082, 22.925273],
    "道滘镇": [113.68172, 23.010254],
    "洪梅镇": [113.61544, 23.000649],
    "麻涌镇": [113.58838, 23.057083],
    "望牛墩镇": [113.662645, 23.061574],
    "中堂镇": [113.663936, 23.09865],
    "高埗镇": [113.752358, 23.097245],
    "松山湖": [113.890883, 22.930098],
    "滨海湾": [113.712094, 22.772249],
    //"虎门港": [113.595836, 22.878448],
    //"生态园": [113.933176, 23.069244],
}

var StreetJsonData=[
  { idcode: 441918, stcode: 441900003000, name: "东城区", fullname: "东城街道办事处", point: [113.789591, 23.033939] },
  { idcode: 441919, stcode: 441900004000, name: "南城区", fullname: "南城街道办事处", point: [113.749579, 23.024861] },
  { idcode: 441904, stcode: 441900005000, name: "万江区", fullname: "万江街道办事处", point: [113.744808, 23.052907] },
  { idcode: 441922, stcode: 441900006000, name: "莞城区", fullname: "莞城街道办事处", point: [113.755568, 23.045351] },
  { idcode: 441913, stcode: 441900101000, name: "石碣镇", fullname: "石碣镇", point: [113.819816, 23.10501] },
  { idcode: 441911, stcode: 441900102000, name: "石龙镇", fullname: "石龙镇", point: [113.880728, 23.111615] },
  { idcode: 441905, stcode: 441900103000, name: "茶山镇", fullname: "茶山镇", point: [113.875579, 23.08251] },
  { idcode: 441920, stcode: 441900104000, name: "石排镇", fullname: "石排镇", point: [113.94655, 23.09486] },
  { idcode: 441926, stcode: 441900105000, name: "企石镇", fullname: "企石镇", point: [114.028531, 23.079041] },
  { idcode: 441936, stcode: 441900106000, name: "横沥镇", fullname: "横沥镇", point: [113.972995, 23.024814] },
  { idcode: 441934, stcode: 441900107000, name: "桥头镇", fullname: "桥头镇", point: [114.109497, 23.030029] },
  { idcode: 441910, stcode: 441900108000, name: "谢岗镇", fullname: "谢岗镇", point: [114.155141, 22.967218] },
  { idcode: 441933, stcode: 441900109000, name: "东坑镇", fullname: "东坑镇", point: [113.954651, 22.995098] },
  { idcode: 441906, stcode: 441900110000, name: "常平镇", fullname: "常平镇", point: [113.999511, 22.981052] },
  { idcode: 441928, stcode: 441900111000, name: "寮步镇", fullname: "寮步镇", point: [113.881157, 23.003838] },
  { idcode: 441914, stcode: 441900112000, name: "樟木头镇", fullname: "樟木头镇", point: [114.089784, 22.920827] },
  { idcode: 441907, stcode: 441900113000, name: "大朗镇", fullname: "大朗镇", point: [113.950584, 22.945658] },
  { idcode: 441902, stcode: 441900114000, name: "黄江镇", fullname: "黄江镇", point: [114.009988, 22.921615] },
  { idcode: 441929, stcode: 441900115000, name: "清溪镇", fullname: "清溪镇", point: [114.17089, 22.85031] },
  { idcode: 441915, stcode: 441900116000, name: "塘厦镇", fullname: "塘厦镇", point: [114.075528, 22.813052] },
  { idcode: 441912, stcode: 441900117000, name: "凤岗镇", fullname: "凤岗镇", point: [114.143323, 22.75306] },
  { idcode: 441921, stcode: 441900118000, name: "大岭山镇", fullname: "大岭山镇", point: [113.848731, 22.90585] },
  { idcode: 441927, stcode: 441900119000, name: "长安镇", fullname: "长安镇", point: [113.809036, 22.821046] },
  { idcode: 441917, stcode: 441900121000, name: "虎门镇", fullname: "虎门镇", point: [113.679324, 22.820653] },
  { idcode: 441932, stcode: 441900122000, name: "厚街镇", fullname: "厚街镇", point: [113.676673, 22.941392] },
  { idcode: 441903, stcode: 441900123000, name: "沙田镇", fullname: "沙田镇", point: [113.624082, 22.925273] },
  { idcode: 441924, stcode: 441900124000, name: "道滘镇", fullname: "道滘镇", point: [113.68172, 23.010254] },
  { idcode: 441909, stcode: 441900125000, name: "洪梅镇", fullname: "洪梅镇", point: [113.61544, 23.000649] },
  { idcode: 441901, stcode: 441900126000, name: "麻涌镇", fullname: "麻涌镇", point: [113.58838, 23.057083] },
  { idcode: 441930, stcode: 441900127000, name: "望牛墩镇", fullname: "望牛墩镇", point: [113.662645, 23.061574] },
  { idcode: 441923, stcode: 441900128000, name: "中堂镇", fullname: "中堂镇", point: [113.663936, 23.09865] },
  { idcode: 441908, stcode: 441900129000, name: "高埗镇", fullname: "高埗镇", point: [113.752358, 23.097245] },
  { idcode: 441916, stcode: 441900401000, name: "松山湖", fullname: "松山湖管委会", point: [113.890883, 22.930098] },
  { idcode: 441925, stcode: 441900402000, name: "滨海湾", fullname: "滨海湾新区", point: [113.712094, 22.772249] }

  //{ idcode: 441925, stcode: 441900402000, name: "虎门港", fullname: "虎门港管委会", point: [113.595836, 22.878448] },
  //{ idcode: 441931, stcode: 441900403000, name: "生态园", fullname: "东莞生态园", point: [113.933176, 23.069244] },
]

//根据街镇ID获取整条信息
var StreetJsonCom = {
    getJsonInfo: function (idcode)
    {
        var json = {};
        $.each(StreetJsonData, function (i,s) {
            if (s.idcode == idcode)
            {
                json = s;
                return json;
            }
        })
        return json;
    },
    getJsonInfoByName: function (name) {
        var json = {};
        $.each(StreetJsonData, function (i, s) {
            if (s.name == name) {
                json = s;
                return json;
            }
        })
        return json;
    }
}